cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'folkloreatelier/fonts'
tap 'homebrew/php'

cask 'java'
cask 'xquartz'

brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'awsebcli'
brew 'coreutils'
brew 'dockutil'
brew 'css3-font-converter'
brew 'ffmpeg', args: ['with-faac', 'with-freetype', 'with-ffplay', 'with-libssh', 'with-libvorbis', 'with-libvpx', 'with-openjpeg', 'with-speex', 'with-rtmpdump', 'with-theora', 'with-webp', 'with-x265']
brew 'go'
brew 'git'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'heroku'
brew 'homebrew/php/php71'
brew 'homebrew/php/php71-xdebug'
brew 'homebrew/php/php71-mcrypt'
brew 'homebrew/php/php71-imagick', from_source: true
brew 'kops'
brew 'kubectl'
brew 'kubernetes-helm'
brew 'kube-aws'
brew 'lame'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mysql'
brew 'nvm'
brew 'openssl'
brew 'packer'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'terraform'
brew 'tmux'
brew 'transmission'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'wakeonlan'
brew 'wine'

cask 'arq'
cask 'android-sdk'
cask 'android-studio'
cask 'arduino'
cask 'atom'
cask 'airfoil'
cask 'beersmith2'
cask 'chefdk'
cask 'cyberduck'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'gemini'
cask 'google-chrome'
cask 'google-photos-backup-and-sync'
cask 'google-cloud-sdk'
cask 'hammerspoon'
cask 'minikube'
cask 'iterm2'
cask 'poedit'
cask 'postman'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'texturepacker'
cask 'transmission-remote-gui'
cask 'virtualbox'
cask 'vlc'
cask 'vagrant'
